[{
                "question_num": "QUESTION 1",
                "type":"5",
		"question": "On a Linux router, packet forwarding for IPv4 has been enabled. After a reboot, <br> the machine no longer forwards IP packets from other hosts. <br> The command: echo 1 > /proc/sys/net/ipv4/ip_forward temporarily resolves this issue. <br> Which one of the following options is the best way to ensure this setting is saved across system restarts?",
		"A": "echo 1 > /proc/sys/net/ipv4/ip_forward to the root user login script",
		"B": "Add echo 1 > /proc/sys/net/ipv4/ip_forward to any user login script",
		"C": "In /etc/sysctl.conf change net.ipv4.ip_forward to 1",
		"D": "In /etc/rc.local add net.ipv4.ip_forward = 1",
		"E": "In /etc/sysconfig/iptables-config add ipv4.ip_forward = 1",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 2",
		"question": "What information can be found in the file specified by the status parameter <br> in an OpenVPN server configuration file? (Choose two.)",
	        "type":"5",
		"A": "Errors and warnings generated by the openvpn daemon",
		"B": "Routing information",
		"C": "Statistical information regarding the currently running openvpn daemon",
		"D": "A list of currently connected clients",
		"E": "A history of all clients who have connected at some point",
		"corr_answer": "#B,#D"
	},
	{
		"question_num": "QUESTION 3","type":"5",
		"question": "Which of the following lines in the sshd configuration file should, if present, <br> be changed in order to increase the security of the server? (Choose two.)",

		"A": "Protocol 2, 1",
		"B": "PermitEmptyPasswords no",
		"C": "Port 22",
		"D": "PermitRootLogin yes",
		"E": "IgnoreRhosts yes",
		"corr_answer": "#A,#D"
	},
	{
		"question_num": "QUESTION 4","type":"5",
		"question": "Which of the following nmap parameters scans a target for open TCP ports? (Choose two.)",
		"A": "-sO",
		"B": "-sZ",
		"C": "-sT",
		"D": "-sU",
		"E": "-sS",
		"corr_answer": "#C,#E"
	},
	{
		"question_num": "QUESTION 5","type":"5",
		"question": "Which of the statements below are correct regarding the following commands, <br> which are executed on a Linux router? (Choose two.)",

		"A": "Packets with source or destination addresses from fe80::/64 will never occur in the FORWARD chain",
		"B": "The rules disable packet forwarding because network nodes always use addresses from fe80::/64 to identify routers in their routing tables",
		"C": "ip6tables returns an error for the second command because the affected network is already part of another rule",
		"D": "Both ip6tables commands complete without an error message or warning",
		"E": "The rules suppress any automatic configuration through router advertisements or DHCPv6",
		"corr_answer": "#D,#E"
	},
	{
		"question_num": "QUESTION 6","type":"5",
		"question": "What option in the client configuration file would tell OpenVPN to use a dynamic source port <br> when making a connection to a peer?",
		"A": "src-port",
		"B": "remote",
		"C": "source-port",
		"D": "nobind",
		"E": "dynamic-bind",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 7","type":"5",
		"question": "Which Linux user is used by vsftpd to perform file system operations for anonymous FTP users?",
		"A": "The Linux user which runs the vsftpd process",
		"B": "The Linux user that owns the root FTP directory served by vsftpd",
		"C": "The Linux user with the same user name that was used to anonymously log into the FTP server",
		"D": "The Linux user root, but vsftpd grants access to anonymous users only to globally read-/writeable files",
		"E": "The Linux user specified in the configuration option ftp_username",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 8","type":"5",
		"question": "Which of the following sshd configuration should be set to no in order to fully disable password <br>  based logins? (Choose two.)",
		"A": "PAMAuthentication",
		"B": "ChallengeResponseAuthentication",
		"C": "PermitPlaintextLogin",
		"D": "UsePasswords",
		"E": "PasswordAuthentication",
		"corr_answer": "#B,#E"
	},
	{
		"question_num": "QUESTION 9","type":"5",
		"question": "When the default policy for the netfilter INPUT chain is set to DROP, <br> why should a rule allowing traffic to localhost exist?",
		"A": "All traffic to localhost must always be allowed",
		"B": "It doesn't matter; netfilter never affects packets addressed to localhost",
		"C": "Some applications use the localhost interface to communicate with other applications",
		"D": "syslogd receives messages on localhost",
		"E": "The iptables command communicates with the netfilter management daemon netfilterd on localhost to create and change packet filter rules",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 10","type":"1",
		"question": "What command creates a SSH key pair? (Specify ONLY the command without any path or parameters)",
		"corr_answer": "ssh-keygen"
	},
	{
		"question_num": "QUESTION 11","type":"5",
		"question": "The content of which local file has to be transmitted to a remote SSH server in order to be <br> able to log into the remote server using SSH keys? (Korrigiert)",

		"A": "~/.ssh/authorized_keys",
		"B": "~/.ssh/config",
		"C": "~/.ssh/id_rsa.pub",
		"D": "~/.ssh/id_rsa",
		"E": "~./ssh/known_hosts",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 12","type":"4",
		"question": "What is the name of the network security scanner project which, at the core, is a server with a <br> set of network vulnerability tests?",
		"A": "NetMap",
		"B": "OpenVAS",
		"C": "Smartscan",
		"D": "Wireshark",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 13","type":"4",
		"question": "With fail2ban, what is a 'jail'?",
		"A": "A netfilter rules chain blocking offending IP addresses for a particular service",
		"B": "A group of services on the server which should be monitored for similar attack patterns in the log files",
		"C": "A filter definition and a set of one or more actions to take when the filter is matched",
		"D": "The chroot environment in which fail2ban runs",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 14","type":"4",
		"question": "The program vsftpd, running in a chroot jail, gives the following error: <br> /bin/vsftpd: error while loading shared libraries: libc.so.6: <br> cannot open shared object file: No such file or directory <br> Which of the following <br> actions would fix the error?",
		"A": "The file /etc/ld.so.conf in the root filesystem must contain the path to the appropriate lib directory in the chroot jail",
		"B": "Create a symbolic link that points to the required library outside the chroot jail",
		"C": "Copy the required library to the appropriate lib directory in the chroot jail",
		"D": "Run the program using the command chroot and the option--static_libs",
		"corr_answer": "#C"
	}, {
		"question_num": "QUESTION 15","type":"5",
		"question": "Which of the following Samba configuration parameters is functionally identical to the parameter <br> read only=yes?",
		"A": "browseable=no",
		"B": "read write=no",
		"C": "writeable=no",
		"D": "write only=no",
		"E": "write access=no",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 16","type":"5",
		"question": "How must Samba be configured such that it can check CIFS passwords against those found in <br> /etc/passwd and /etc/shadow?",
		"A": "Set the parameters 'encrypt passwords = yes' and 'password file = /etc/passwd'",
		"B": "Set the parameters 'encrypt passwords = yes', 'password file = /etc/passwd' and 'passwordalgorithm = crypt'",
		"C": "Delete the smbpasswd file and create a symbolic link to the passwd and shadow file",
		"D": "It is not possible for Samba to use /etc/passwd and /etc/shadow directly",
		"E": "Run smbpasswd to convert /etc/passwd and /etc/shadow to a Samba password file",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 17","type":"5",
		"question": "In which CIFS share must printer drivers be placed to allow Point'n'Print driver deployment on <br> Windows? ",
		"A": "winx64drv$",
		"B": "print$",
		"C": "The name of the share is specified in the option print driver share within each printable share in smb.conf",
		"D": "pnpdrivers$",
		"E": "NETLOGON",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 18","type":"5",
		"question": "Which of the following Samba services handles the membership of a file server in an Active Directory <br> domain? (Korrigiert, E?)",
		"A": "winbindd",
		"B": "nmbd",
		"C": "msadd",
		"D": "admemb",
		"E": "samba",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 19","type":"5",
		"question": "Which of the following statements is true regarding the NFSv4 pseudo file system on the NFS server?",
		"A": "It must be called /exports",
		"B": "It usually contains bind mounts of the directory trees to be exported",
		"C": "It must be a dedicated partition on the server",
		"D": "It is defined in the option Nfsv4-Root in /etc/pathmapd.conf",
		"E": "It usually contains symlinks to the directory trees to be exported",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 20","type":"5",
		"question": "A user requests a 'hidden' Samba share, named confidential, similar to the Windows Administration Share. <br> How can this be configured?",
		"A": "<br> [confidential]<br>comment=hidden share <br> path = /srv/smb/hidden<br>....",
		"B": "<br> [$confidential]<br>comment=hidden share <br> path = /srv/smb/hidden <br>.... ",
		"C": "<br> [#confidential]<br>comment=hidden share <br> path = /srv/smb/hidden <br>....",
		"D": "<br> [%confidential]<br>comment=hidden share <br> path = /srv/smb/hidden <br>.... ",
		"E": "<br> [confidential$]<br>comment=hidden share <br> path = /srv/smb/hidden <br>.... ",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 21","type":"5",
		"question": "Which of the following options are valid in /etc/exports? (Choose two.)",
		"A": "rw",
		"B": "ro",
		"C": "rootsquash",
		"D": "norootsquash",
		"E": "uid",
		"corr_answer": "#A,#B"
	}, {
		"question_num": "QUESTION 22","type":"5",
		"question": "Which command is used to configure which file systems a NFS server makes available to clients?",

		"A": "exportfs",
		"B": "mkfs.nfs",
		"C": "mount",
		"D": "nfsservct1",
		"E": "telinit",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 23","type":"5",
		"question": "Which of these tools, without any options, provides the most information when performing DNS queries?",
		"A": "dig",
		"B": "nslookup",
		"C": "host",
		"D": "named-checkconf",
		"E": "named-checkzone",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 24","type":"5",
		"question": "Performing a DNS lookup with dig results in this answer:",
		"A": "There is no . after linuserv.example.net in the PTR record in the forward lookup zone file",
		"B": "There is no . after linuserv in the PTR record in the forward lookup zone file",
		"C": "There is no . after linuserv.example.net in the PTR record in the reverse lookup zone file",
		"D": "The . in the NS definition in the reverse lookup zone has to be removed",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 25","type":"5",
		"question": "What option for BIND is required in the global options to disable recursive <br> queries on the DNS server by default?",
		"A": "allow-recursive-query ( none; );",
		"B": "allow-recursive-query off;",
		"C": "recursion { disabled; };",
		"D": "recursion { none; };",
		"E": "recursion no;",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 26","type":"5",
		"question": "Which of the following DNS records could be a glue record?",

		"A": "ns1.lab A 198.51.100.53",
		"B": "lab NS 198.51.100.53",
		"C": "ns1.lab NS 198.51.100.53",
		"D": "ns1. A 198.51.100.53",
		"E": "ns1.lab GLUE 198.51.100.53",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 27","type":"5",
		"question": "What is DNSSEC used for?",
		"A": "Encrypted DNS queries between nameservers",
		"B": "Cryptographic authentication of DNS zones",
		"C": "Secondary DNS queries for local zones",
		"D": "Authentication of the user that initiated the DNS query",
		"E": "Encrypting DNS queries and answers",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 28","type":"5",
		"question": "What word is missing from the following excerpt of a named.conf file?",
		"A": "networks",
		"B": "net",
		"C": "list",
		"D": "acl",
		"E": " group",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 29","type":"4",
		"question": "In a BIND zone file, what does the @ character indicate?",
		"A": "It's the fully qualified host name of the DNS server",
		"B": "It's an alias for the e-mail address of the zone master",
		"C": "It's the name of the zone as defined in the zone statement in named.conf",
		"D": "It's used to create an alias between two CNAME entries",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 30","type":"5",
		"question": "Which BIND option should be used to limit the IP addresses from which slave name servers may <br> connect?",

		"A": "allow-zone-transfer",
		"B": "allow-transfer",
		"C": "allow-secondary",
		"D": "allow-slaves",
		"E": "allow-queries",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 31","type":"5",
		"question": "In order to protect a directory on an Apache HTTPD web server with a password, this configuration <br>  was added to an .htaccess file in the respective directory: <br> Furthermore, a file /var/www/dir/ .htpasswd was created with the following content: usera:S3cr3t Given that all these files were correctly processed by the web server processes, which of the following statements is true about requests to the directory?",
		"A": "The user usera can access the site using the password s3cr3t",
		"B": "Accessing the directory as usera raises HTTP error code 442 (User Not Existent)",
		"C": "Requests are answered with HTTP error code 500 (Internal Server Error)",
		"D": "The browser prompts the visitor for a username and password but logins for usera do not seem to work",
		"E": "The web server delivers the content of the directory without requesting authentication",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 32","type":"5",
		"question": "Which Apache HTTPD directive enables HTTPS protocol support?",
		"A": "HTTPSEngine on",
		"B": "SSLEngine on",
		"C": "SSLEnable on",
		"D": "HTTPSEnable on",
		"E": "StartTLS on",
		"corr_answer": "#B"
	}, {
		"question_num": "QUESTION 33","type":"1",
		"question": "What configuration directive of the Apache HTTPD server defines <br> where log files are stored? (Specify ONE of the directives without any other options.)",
		"corr_answer": "ErrorLog"
	},
	{
		"question_num": "QUESTION 34","type":"5",
		"question": "Which statements about the Alias and Redirect directives in <br> Apache HTTPD's configuration file are true? (Choose two.)",
		"A": "Alias can only reference files under DocumentRoot",
		"B": "Redirect works with regular expressions",
		"C": "Redirect is handled on the client side",
		"D": "Alias is handled on the server side",
		"E": "Alias is not a valid configuration directive",
		"corr_answer": "#C,#D"
	},
	{
		"question_num": "QUESTION 35","type":"5",
		"question": "Which http_access directive for Squid allows users in the ACL named sales_net to <br> only access the Internet at times specified in the time_acl named sales_time?",
		"A": "http_access deny sales_time sales_net",
		"B": "http_access allow sales_net sales_time",
		"C": "http_access allow sales_net and sales-time",
		"D": "allow http_access sales_net sales_time",
		"E": "http_access sales_net sales_time",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 36","type":"5",
		"question": "Which global option in squid.conf sets the port number or numbers that Squid will use to listen for client requests?",
		"A": "port",
		"B": "client_port",
		"C": "http_port",
		"D": "server_port",
		"E": "squid_port",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 37","type":"5",
		"question": "When using mod_authz_core, which of the following strings can be used as an argument to <br> Require in an Apache HTTPD configuration file to specify the authentication provider? (Choose three.)",
		"A": "method",
		"B": "all",
		"C": "regex",
		"D": "header",
		"E": "expr",
		"corr_answer": "#A,#B,#E"
	},
	{
		"question_num": "QUESTION 38","type":"5",
		"question": "Which tool creates a Certificate Signing Request (CSR) for serving HTTPS with Apache HTTPD?",
		"A": "apachect1",
		"B": "certgen",
		"C": "cartool",
		"D": "httpsgen",
		"E": "openssl",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 39","type":"5",
		"question": "In response to a certificate signing request, a certification authority sent a web server certificate <br> along with the certificate of an intermediate certification authority that <br> signed the web server certificate. What should be done with the intermediate certificate in order to use the web server certificate with Apache HTTPD?",

		"A": "The intermediate certificate should be merged with the web server's certificate into one file that is specified in SSLCertificateFile",
		"B": "The intermediate certificate should be used to verify the certificate before its deployment on the web server and can be deleted",
		"C": "The intermediate certificate should be stored in its own file which is referenced in SSLCaCertificateFile",
		"D": "The intermediate certificate should be improved into the certificate store of the web browser used to test the correct operation of the web server",
		"E": "The intermediate certificate should be archived and resent to the certification authority in order to request a renewal of the certificate",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 40","type":"1",
		"question": "Which directive in a Nginx server configuration block defines the TCP ports on which the virtual host will <br> be available, and which protocols it will use? (Specify ONLY the option name without any values.)",
		"corr_answer": "listen"
	},
	{
		"question_num": "QUESTION 41","type":"5",
		"question": "When trying to reverse proxy a web server through Nginx, what keyword is missing from the following <br> configuration sample? <br> location/ { <br> ________http://proxiedserver:8080; <br> }",
		"A": "remote_proxy",
		"B": "reverse_proxy",
		"C": "proxy_reverse",
		"D": "proxy_pass",
		"E": "forward_to",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 42","type":"4",
		"question": "If there is no access directive, what is the default setting for OpenLDAP? (Korrigiert)",
		"A": "<br> access to * <br> by *  read",
		"B": "<br> access to * <br> by anonymous  none <br> by * read",
		"C": "<br> access to * <br> by anonymous  auth <br> by * read",
		"D": "<br> access to * <br> by anonymous  write <br> by * read",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 43","type":"5",
		"question": "A host, called lpi, with the MAC address 08:00:2b:4c:59:23 should always be given the IP address of 192.168.1.2 by a DHCP server <br> running ISC DHCPD. Which of the following configurations will achieve this?",
		"A": "<br> host lpi { <br> hardware-ethernet 08:00:2b:4c:59:23; <br> fixed-address 192.168.1.2; <br> }",
		"B": "<br> host lpi { <br> mac 08:00:2b:4c:59:23; <br> ip 192.168.1.2; <br> }",
		"C": "<br> host lpi =08:00:2b:4c:59:23 192.168.1.2",
		"D": "<br> host lpi { <br> hardware ethernet 08:00:2b:4c:59:23; <br> fixed-address 192.168.1.2; <br> }",
		"E": "<br> host lpi { <br> hardware-address 08:00:2b:4c:59:23; <br> fixed-ip 192.168.1.2; <br> }",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 44","type":"5",
		"question": "How is the LDAP administrator account configured when the rootdn <br> and rootpw directives are not present in the slapd.conf file?",
		"A": "The default account admin with the password admin are used",
		"B": "The account is defined by an ACL in slapd.conf",
		"C": "The default account admin is used without a password",
		"D": "The account is defined in the file /etc/ldap.secret",
		"E": "The account is defined in the file /etc/ldap.root.conf",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 45","type":"4",
		"question": "Which of the following PAM modules allows the system administrator to use an arbitrary file <br> containing a list of user and group names with restrictions on the system resources available to them?",
		"A": "pam_filter",
		"B": "pam_limits",
		"C": "pam_listfile",
		"D": "pam_unix",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 46","type":"1",
		"question": "According to this LDIF excerpt, which organizational unit is Robert Smith part of? (Specify only the organizational unit.) <br>dn: cn=Robert Smith, ou=people, dc=example, dc=com <br>objectclass: inetOrgPerson <br>cn: Robert Smith <br>cn: Robert J Smith <br>cn: bob smith <br>sn: smith<br>uid: rjsmith<br>.........",
		"corr_answer": "people"
	},
	{
		"question_num": "QUESTION 47","type":"5",
		"question": "In a PAM configuration file, which of the following is true about the required control flag?",
		"A": "If the module returns success, no more modules of the same type will be invoked",
		"B": "The success of the module is needed for the module-type facility to succeed. If it returns a failure, control is returned to the calling application",
		"C": "The success of the module is needed for the module-type facility to succeed. However, all remaining modules of the same type will be invoked",
		"D": "The module is not critical and whether it returns success or failure is not important",
		"E": "If the module returns failure, no more modules of the same type will be invoked",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 48","type":"1",
		"question": "What is the name of the root element of the LDAP tree holding the configuration of an OpenLDAP server that is using <br> directory based configuration? (Specify ONLY the element 's name without any additional information.) (Korrigiert)",
		"corr_answer": "cn=config oder config oder cn"
	},
	{
		"question_num": "QUESTION 49","type":"5",
		"question": "How are PAM modules organized and stored? (Korrigiert)",
		"A": "As plain text files in /etc/security/",
		"B": "A statically linked binaries in /etc/pam.d/bin/",
		"C": "As Linux kernel modules within the respective sub directory of /lib/modules/",
		"D": "As shared object files within the /lib/ directory hierarchy",
		"E": "As dynamically linked binaries in /usr/lib/pam/sbin/",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 50","type":"5",
		"question": "Which of the following statements in the ISC DHCPD configuration is used to specify whether or not an address pool <br> can be used by nodes which have corresponding host section in the configuration?",
		"A": "identified-nodes",
		"B": "unconfigured-hosts",
		"C": "missing-peers",
		"D": "unmatched-hwaddr",
		"E": "unknown-clients",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 51","type":"1",
		"question": "In order to specify alterations to an LDAP entry, what keyword is missing from the following LDIF file excerpt? <br> Specify the keyword only and no other information. (Korrigiert)",
		"corr_answer": "add, delete, modify"
	},
	{
		"question_num": "QUESTION 52","type":"1",
		"question": "Which OpenLDAP client command can be used to change the password for an LDAP entry? <br> (Specify ONLY the command without any path or parameters.)",
		"corr_answer": "ldappasswd"
	},
	{
		"question_num": "QUESTION 53","type":"5",
		"question": "A company is transitioning to a new DNS domain name and wants to accept e-mail for both domains for all of <br> its users on a Postfix server. Which configuration option should be updated to accomplish this?",
		"A": "mydomain",
		"B": "mylocations",
		"C": "mydestination",
		"D": "myhosts",
		"E": "mydomains",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 54","type":"1",
		"question": "What is the path to the global Postfix configuration file? (Specify the full name of the file, including path.)",
		"corr_answer": "/etc/postfix/main.cf"
	},
	{
		"question_num": "QUESTION 55","type":"5",
		"question": "When are Sieve filters usually applied to an email?",
		"A": "When the email is delivered to a mailbox",
		"B": "When the email is relayed by an SMTP server",
		"C": "When the email is received by an SMTP smarthost",
		"D": "When the email is sent to the first server by an MUA",
		"E": "When the email is retrieved by an MUA",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 56","type":"5",
		"question": "It has been discovered that the company mail server is configured as an open relay. Which of the following actions <br> would help prevent the mail server from being used as an open relay while maintaining <br> the possibility to receive company mails? (Choose two.)",
		"A": "Restrict Postfix to only accept e-mail for domains hosted on this server",
		"B": "Configure Dovecot to support IMAP connectivity",
		"C": "Configure netfilter to not permit port 25 traffic on the public network",
		"D": "Restrict Postfix to only relay outbound SMTP from the internal network",
		"E": "Upgrade the mailbox format from mbox to maildir",
		"corr_answer": "#C,#D"
	},
	{
		"question_num": "QUESTION 57","type":"5",
		"question": "After the installation of Dovecot, it is observed that the dovecot processes are shown in ps ax like this: <br> In order to associate the processes with users and peers, the username, IP address of the peer and <br> the connection status, which of the following options must be set?",
		"A": "--with-linux-extprocnames for ./configure when building Dovecot",
		"B": "sys.ps.allow_descriptions = 1 in sysct1.conf or /proc",
		"C": "proc.all.show_status = 1 in sysctl.conf or /proc",
		"D": "verbose_proctitle = yes in the Dovecot configuration",
		"E": "process_format = '%u %I %s' in the Dovecot configuration",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 58","type":"4",
		"question": "Which Postfix command can be used to rebuild all of the alias database files with a <br> single invocation and without the need for any command line arguments?",
		"A": "makealiases",
		"B": "newaliases",
		"C": "postalias",
		"D": "postmapbuild",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 59","type":"1",
		"question": "Which action in a Sieve filter forwards a message to another email address without <br> changing the message? (Specify ONLY the action's name without any parameters.)",
		"corr_answer": "redirect"
	},
	{
		"question_num": "QUESTION 60","type":"5",
		"question": "Which of the following authentication mechanisms are supported by Dovecot? (Choose three.)",
		"A": "ldap",
		"B": "digest-md5",
		"C": "cram-md5",
		"D": "plain (or text, see Exam)",
		"E": "krb5",
		"corr_answer": "#B,#C,#D"
	},
	{
		"question_num": "QUESTION 61","type":"5",
		"question": "Which of the following services belongs to NFSv4 and does not exist in NFSv3?",
		"A": "rpc.idmapd",
		"B": "rpc.statd",
		"C": "nfsd",
		"D": "rpc.mountd",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 62","type":"5",
		"question": "Which of the following actions synchronizes UNIX passwords with the Samba passwords when <br> the encrypted Samba password is changed using smbpasswd?",
		"A": "There are no actions to accomplish this since is not possible.",
		"B": "Run netvamp regularly, to convert the passwords.",
		"C": "Run winbind -sync, to synchronize the passwords.",
		"D": "Add unix password sync = yes to smb.conf",
		"E": "Add smb unix password = sync to smb.conf",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 63","type":"5",
		"question": "In order to join a file server to the Active Directory domain intra.example.com, the <br> following smb.conf has been created: The command net ads join raises an error and the server is not joined to the domain. What should be done to successfully join the domain? (Korrigiert)",
		"A": "Change server role to ad member server to join an Active Directory domain instead of an NT4 domain.",
		"B": "Add realm = intra.example.com to the smb.conf and change workgroup to the domain's netbios workgroup name.",
		"C": "Manually create a machine account in the Active Directory domain and specify the machine account's name with -U when starting net ads join.",
		"D": "Remove the winbind enum users and winbind enum groups since winbind is incompatible with Active Directory domains.",
		"E": "Remove all idmap configuration stanzas since the id mapping is defined globally in an Active Directory domain and cannot be changed on a member server.",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 64","type":"1",
		"question": "In order to export /usr and /bin via NFSv4, /exports was created and contains working bind mounts <br> to /usr and /bin. The following lines are added to /etc/exports on the NFS server: <br> After running mount -t nfsv4 server:/ /mnt of an NFC-Client, it is observed that /mnt contains the content of the server's /usr directory instead of the content of the NFSv4 root folder. Which option in /etc/exports has to be changed or removed in order to make the NFSv4 root folder appear when mounting the highest level of the server? (Specify ONLY the option name without any values or parameters.)",
		"corr_answer": "nfs-client"
	},
	{
		"question_num": "QUESTION 65","type":"5",
		"question": "What does the samba-tool testparm command confirm regarding the Samba configuration?",
		"A": "The configuration loads successfully.",
		"B": "The service operates as expected.",
		"C": "The Samba services are started automatically when the system boots.",
		"D": "The netfilter configuration on the Samba server does not block any access to the services defined in the configuration.",
		"E": "All running Samba processes use the most recent configuration version.",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 66","type":"5",
		"question": "Select the Samba option below that should be used if the main intention is to setup a guest printer service?",
		"A": "security = cups",
		"B": "security = ldap",
		"C": "security = pam",
		"D": "security = share",
		"E": "security =printing",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 67","type":"5",
		"question": "The Samba configuration file contains the following lines: A workstation is on the wired network with an <br> IP address of 192.168.1.177 but is unable to access the Samba server. <br> A wireless laptop with an IP address 192.168.2.93 can access the Samba server. Additional trouble shooting shows that almost every machine on the wired network is unable to access the Samba server. Which alternate host allow declaration will permit wired workstations to connect to the Samba server without denying access to anyone else?",
		"A": "host allow = 192.168.1.1-255",
		"B": "host allow = 192.168.1.100 192.168.2.200 localhost",
		"C": "host deny = 192.168.1.100/255.255.255.0 192.168.2.31 localhost",
		"D": "host deny = 192.168.2.200/255.255.255.0 192.168.2.31 localhost",
		"E": "host allow = 192.168.1.0/255.255.255.0 192.168.2.0/255.255.255.0 localhost",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 68","type":"1",
		"question": "What command displays NFC kernel statistics? (Specify ONLY the command without any path or parameters.)",
		"corr_answer": "nfsstat"
	},
	{
		"question_num": "QUESTION 69","type":"4",
		"question": "Which keyword is used in the Squid configuration to define networks and times used to limit access to the service?",
		"A": "acl",
		"B": "allow",
		"C": "http_allow",
		"D": "permit",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 70","type":"5",
		"question": "The following Apache HTTPD configuration has been set up to create a virtual <br> host available at www.example.com and www2.example.com: <br> <VirtualHost *:80> <br> ServerName www.example.com <br> ServerName www2.example.com <br> ServerAdmin webmaster@example.com <br> DocumentRoot /var/www/ <br> <Directory /srv/www/> <br> Require all granted <br> </Directory><br> </VirtualHost> <br> Even though Apache HTTPD correctly processed the configuration file, requests to both names are not handled correctly. What should be changed in order to ensure correct operations? (Korrigiert)",
		"A": "The configuration must be split into two VirtualHost sections since each virtual host may only have one name.",
		"B": "The port mentioned in opening VirtualHost tag has to be appended to the ServerName declaration's values.",
		"C": "Both virtual host names have to be placed as comma separated values in one ServerName declaration.",
		"D": "Both virtual host names have to be mentioned in the opening VirtualHost tag.",
		"E": "Only one Server name declaration may exist, but additional names can be declared in ServerAlias options.",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 71","type":"5",
		"question": "Given the following Squid configuration excerpt: cache_dir ufs /var/spool/squid3/ 1024 16 256 Which of the <br> following directories will exist directly within the directory: /var/spool/squid3/? (Choose two.) (Korrigiert)",
		"A": "0F",
		"B": "A0",
		"C": "0b",
		"D": "FF",
		"E": "00",
		"corr_answer": "#A,#E"
	},
	{
		"question_num": "QUESTION 72","type":"5",
		"question": "Which of the following statements are true regarding Server Name Indication (SNI)? (Choose two.)",
		"A": "It supports transparent failover of TLS sessions from one web server to another.",
		"B": "It allows multiple SSL/TLS secured virtual HTTP hosts to coexist on the same IP address.",
		"C": "It enables HTTP servers to update the DNS of their virtual hosts' names using the X 509 certificates of the virtual hosts.",
		"D": "It provides a list of available virtual hosts to the client during the TLS handshake.",
		"E": "It submits the host name of the requested URL during the TLS handshake.",
		"corr_answer": "#B,#E"
	},
	{
		"question_num": "QUESTION 73","type":"4",
		"question": "Which Apache HTTPD configuration directive specifies the RSA private key that was used in <br> the generation of the SSL certificate for the server?",
		"A": "SSLCertificateKeyFile",
		"B": "SSLKeyFile",
		"C": "SSLPrivateKeyFile",
		"D": "SSLRSAKeyFile",
		"corr_answer": " #A"
	},
	{
		"question_num": "QUESTION 74","type":"4",
		"question": "There is a restricted area in a site hosted by Apache HTTPD, which requires users to authenticate <br> against the file /srv/www/security/sitepasswd.Which command is used to CHANGE the <br> password of existing users, without losing data, when Basic authentication is being used? (Korrigiert)",
		"A": "htpasswd -c /srv/www/security/sitepasswd user",
		"B": "htpasswd /srv/www/security/sitepasswd user",
		"C": "htpasswd -n /srv/www/security/sitepasswd user",
		"D": "htpasswd -D /srv/www/security/sitepasswd user",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 75","type":"4",
		"question": "Which Apache HTTPD configuration directive is used to specify the method of authentication, e.g. None or Basic?",

		"A": "AuthUser",
		"B": "AllowedAuthUser",
		"C": "AuthType",
		"D": "AllowAuth",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 76","type":"5",
		"question": "Which of the following are logging directives in Apache HTTPD? (Choose two.) <br> (Anmerkung, eigentlich müssten drei richtig sein (ABC))",

		"A": "TransferLog",
		"B": "CustomLog",
		"C": "ErrorLog",
		"D": "ServerLog",
		"E": "VHostLog",
		"corr_answer": "#B,#C"
	},
	{
		"question_num": "QUESTION 77","type":"5",
		"question": "Which option within a Nginx server configuration section defines the <br> file system path from which the content of the server is retrieved?",
		"A": "location",
		"B": "htdocs",
		"C": "DocumentRoot",
		"D": "root",
		"E": "base_dir",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 78","type":"5",
		"question": "With Nginx, which of the following directives is used to proxy requests to a FastCGI application?",
		"A": "fastcgi_pass",
		"B": "fastcgi_proxy",
		"C": "proxy_fastcgi",
		"D": "proxy_fastcgi_pass",
		"E": "fastcgi_forward",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 79","type":"5",
		"question": "Which of the following information has to be submitted to a <br> certification authority in order to request a web server certificate?",
		"A": "The web server's private key.",
		"B": "The IP address of the web server.",
		"C": "The list of ciphers supported by the web server.",
		"D": "The web server's SSL configuration file.",
		"E": "The certificate signing request.",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 80","type":"5",
		"question": "For what purpose is TCP/IP stack fingerprinting used by nmap?",
		"A": "It is used to determine the remote operating system.",
		"B": "It is used to filter out responses from specific servers.",
		"C": "It is used to identify duplicate responses from the same remote server.",
		"D": "It is used to masquerade the responses of remote servers.",
		"E": "It is used to uniquely identify servers on the network for forensics.",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 81","type":"4",
		"question": "To allow X connections to be forwarded from or through an SSH server,<br> what configuration keyword must be set to yes in the sshd configuration file?",
		"A": "AllowForwarding",
		"B": "ForwardingAllow",
		"C": "X11ForwardingAllow",
		"D": "X11Forwarding",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 82","type":"4",
		"question": "What is the standard port used by OpenVPN?",
		"A": "1723",
		"B": "4500",
		"C": "500",
		"D": "1194",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 83","type":"1",
		"question": "What option in the sshd configuration file instructs sshd to permit only <br> specific user names to log in to a system? (Specify ONLY the option name without any values.) (Korrigiert)",
		"corr_answer": "AllowUsers"
	},
	{
		"question_num": "QUESTION 84","type":"5",
		"question": "Using its standard configuration, how does fail2ban block offending SSH clients? (Korrigiert)",
		"A": "By rejecting connections due to its role as a proxy in front of SSHD.",
		"B": "By modifying and adjusting the SSHD configuration.",
		"C": "By creating and maintaining netfilter rules.",
		"D": "By creating null routes that drop any answer packets sent to the client.",
		"E": "By modifying and adjusting the TCP Wrapper configuration for SSHD.",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 85","type":"5",
		"question": "Which FTP names are recognized as anonymous users in vsftp when the <br> option anonymous_enable is set to yes in the configuration files? (Choose two.)",
		"A": "anonymous",
		"B": "ftp",
		"C": "In the described configuration, any username which neither belongs to an existing user nor has another special meaning is treated as anonymous user.",
		"D": "nobody",
		"E": "guest",
		"corr_answer": "#A,#B"
	},
	{
		"question_num": "QUESTION 86","type":"5",
		"question": "Which of the following commands can be used to connect and <br> interact with remote TCP network services? (Choose two.)",
		"A": "nettalk",
		"B": "nc",
		"C": "telnet",
		"D": "cat",
		"E": "netmap",
		"corr_answer": "#B,#C"
	},
	{
		"question_num": "QUESTION 87","type":"5",
		"question": "To which destination will a route appear in the Linux routing table after <br> activating IPv6 on a router's network interface, even when no global IPv6 addresses have been assigned to the interface? (Korrigiert)",
		"A": "fe80::/10",
		"B": "0::/128",
		"C": "0::/0",
		"D": "fe80::/64",
		"E": "2000::/3",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 88","type":"5",
		"question": "In order to prevent all anonymous FTP users from listing uploaded file names, <br> what security precaution can be taken when creating an upload directory?",
		"A": "The directory must not have the execute permission set.",
		"B": "The directory must not have the read permission set.",
		"C": "The directory must not have the read or execute permission set.",
		"D": "The directory must not have the write permission set.",
		"E": "The directory must not contain other directories.",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 89","type":"5",
		"question": "Which command is used to administer IPv6 netfilter rules?",
		"A": "iptables",
		"B": "iptablesv6",
		"C": "iptables6",
		"D": "ip6tables",
		"E": "ipv6tables",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 90","type":"5",
		"question": "Which netfilter table contains built-in chains called INPUT, OUTPUT and FORWARD?",
		"A": "ipconn",
		"B": "filter",
		"C": "nat",
		"D": "default",
		"E": "masq",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 91","type":"5",
		"question": "After running ssh-keygen and accepting the default values, which of the <br> following files are changed or created? (Choose two.)",
		"A": "~/.ssh/id_rsa.key",
		"B": "~/.ssh/id_rsa.pub",
		"C": "~/.ssh/id_rsa.prv",
		"D": "~/.ssh/id_rsa.crt",
		"E": "~/.ssh/id_rsa",
		"corr_answer": "#B,#E"
	},
	{
		"question_num": "QUESTION 92","type":"5",
		"question": "Which of the following OpenVPN configuration options makes OpenVPN forward <br> network packets between VPN clients itself instead of passing the packets on to the Linux host which runs <br> the OpenVPN server for further processing?",
		"A": "inter-client-traffic",
		"B": "client-to-client",
		"C": "client-router",
		"D": "client-pass",
		"E": "grant-client-traffic",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 93","type":"5",
		"question": "Which of these tools provides DNS information in the following format? (Kein Ausgabeformat)",
		"A": "dig",
		"B": "nslookup",
		"C": "host",
		"D": "named-checkconf",
		"E": "named-checkzone",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 94","type":"5",
		"question": "Which rdnc sub command can be used in conjunction with the name of a zone in <br> order to make BIND reread the content of the specific zone file without reloading other zones as well? (Korrigiert)",
		"A": "lookup",
		"B": "reload",
		"C": "fileupdate",
		"D": "reread",
		"E": "zoneupdate",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 95","type":"5",
		"question": "A zone file contains the following lines: and is included in the BIND configuration using <br> this configuration stanza:Which problem is contained in this configuration?",
		"A": "The zone statement is the BIND configuration must contain the cross-zone-data yes; statement.",
		"B": "The zone cannon contain records for a name which is outside the zone's hierarchy.",
		"C": "The $ORIGIN declaration cannot be used in zone files that are included for a specific zone name in the BIND configuration.",
		"D": "An A record cannot contain an IPv4 address because its value is supposed to be a reverse DNS name.",
		"E": "Names of records in a zone file cannot be fully qualified domain names.",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 96","type":"5",
		"question": "Which of the following DNS record types is used for reverse DNS queries?",
		"A": "CNAME",
		"B": "IN",
		"C": "PTR",
		"D": "REV",
		"E": "RIN",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 97","type":"1",
		"question": "According to the configuration below, what is the full e-mail address of the administrator <br> for this domain? (Korrigiert) <br> $ORIGIN example.com <br> @ IN SOA mars.example.com pluto.example.com ( <br> 2016073142 <br> 10800 <br> 3600 <br> 604800 <br> 86400 )",
		"corr_answer": "pluto@example.com"
	},
	{
		"question_num": "QUESTION 98","type":"5",
		"question": "What is the purpose of DANE?",
		"A": "Verify the integrity of name information retrieved via DNS.",
		"B": "Allow secure dynamic DNS updates.",
		"C": "Invalidate name information stored on caching name servers to speed up DNS updates.",
		"D": "Discover which servers within a DNS domain offer a specific service.",
		"E": "Provide a way to verify the association of X 509 certificates to DNS host names.",
		"corr_answer": "#E"
	},
	{
		"question_num": "QUESTION 99","type":"5",
		"question": "A BIND server should be upgraded to use TSIG. Which configuration parameters <br> should be added if the server should use the algorithm hmac-md5 and the key skrKc4DoTzi/takIlPi7JZA==?",
		"A": "<br> TSIG server.example.com. { <br> algorithm hmac-mad5; <br> secret 'dessDffrfrf=='; <br> };",
		"B": "<br> key.server.example.com. { <br> algorithm hmac-mad5; <br> secret dessDffrfrf==; <br> };",
		"C": "<br> key.server.example.com. { <br> algorithm hmac-mad5; <br> secret 'dessDffrfrf=='; <br> };",
		"D": "<br> keyserver.example.com. { <br> algorithm=hmac-mad5; <br> secret 'dessDffrfrf=='; <br> };",
		"E": "<br> key.server.example.com.  <br> algorithm hmac-mad5; <br> secret 'dessDffrfrf=='; <br> ;",
		"corr_answer": "#C"
	},

	{
		"question_num": "QUESTION 100","type":"5",
		"question": "Which option in named.conf specifies which host are permitted to ask for domain name <br> information from the server?",
		"A": "allowed-hosts",
		"B": "accept-query",
		"C": "permit-query",
		"D": "allow-query",
		"E": "query-group",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 101","type":"1",
		"question": "Which doveadm sub-command displays a list of connections of Dovecot in the <br> following format? (Specify ONLY the command without any parameters.)",
		"corr_answer": "who"
	},
	{
		"question_num": "QUESTION 102","type":"5",
		"question": "Which of the following actions are available in Sieve core filters? (Choose three.)",
		"A": "drop",
		"B": "discard",
		"C": "fileinto",
		"D": "relay",
		"E": "reject",
		"corr_answer": "#C,#D,#E"
	},
	{
		"question_num": "QUESTION 103","type":"5",
		"question": "Which of the following statements allow the logical combinations of conditions <br> in Sieve filters? (Choose two.)",
		"A": "allof",
		"B": "anyof",
		"C": "noneof",
		"D": "and",
		"E": "or",
		"corr_answer": "#A,#E"
	},
	{
		"question_num": "QUESTION 104","type":"5",
		"question": "Which configuration parameter on a Postfix server modifies only the sender address <br> and not the recipient address?",
		"A": "alias_maps",
		"B": "alias_rewrite_maps",
		"C": "sender_canonical_maps",
		"D": "sender_rewrite_maps",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 105","type":"1",
		"question": "Which option in the Postfix configuration makes Postfix pass email to external <br> destinations to another SMTP-server? (Specify ONLY the option name without any values.)",
		"corr_answer": " relay"
	},
	{
		"question_num": "QUESTION 106","type":"5",
		"question": "What is the name of the Dovecot configuration variable that <br> specifies the location of user mail?",
		"A": "mbox",
		"B": "mail_location",
		"C": "user_dir",
		"D": "maildir",
		"E": "user_mail_dir",
		"corr_answer": "#B"
	},
	{
		"question_num": "QUESTION 107","type":"5",
		"question": "In the main Postfix configuration file, how are service <br> definitions continued on the next line?",
		"A": "It isn't possible. The service definition must fit on one line.",
		"B": "The initial line must end with a backslash character (\\).",
		"C": "The following line must begin with a plus character (+).",
		"D": "The following line must begin with white space indentation.",
		"E": "The service definition continues on the following lines until all of the required fields are specified.",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 108","type":"5",
		"question": "Which of the following commands displays an overview of the Postfix <br> queue content to help identify remote sites that are causing excessive mail traffic?",
		"A": "mailtraf",
		"B": "queuequery",
		"C": "qshape",
		"D": "postmap",
		"E": "poststats",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 109","type":"5",
		"question": "Which of these sets of entries does the following command return?",
		"A": "Entries that don't have a cn of marie or don't have a telephoneNumber that begins with 9.",
		"B": "Entries that have a cn of marie or don't have a telephoneNumber beginning with 9.",
		"C": "Entries that have a cn of marie and a telephoneNumber that ending with 9.",
		"D": "Entries that don't have a cn of marie and don't have a telephoneNumber beginning with 9.",
		"E": "Entries that have a cn of marie or have a telephoneNumber beginning with 9.",
		"corr_answer": "#C"
	},
	{
		"question_num": "QUESTION 110","type":"5",
		"question": "Which of the following types of IPv6 address assignments<br>  does DHCPv6 support? (Choose three.)",
		"A": "Assignments of normal IPv6 addresses that can be renewed.",
		"B": "Assignments of temporary IPv6 addresses that cannot be renewed.",
		"C": "Assignments of blacklisted IPv6 addresses that should no longer be used.",
		"D": "Assignments of IPv6 prefixes that can be used for routing or further assignments.",
		"E": "Assignments of anonymous IPv6 addresses whose assignment is not logged by the DHCPv6 server.",
		"corr_answer": "#A,#B,#D"
	},
	{
		"question_num": "QUESTION 111","type":"1",
		"question": "Which attitude of an object in LDAP defines which other attributes <br> can be set for the object? (Specify ONLY the attribute name without any values.)",
		"corr_answer": "class"
	},
	{
		"question_num": "QUESTION 112","type":"5",
		"question": "Which of the following commands is used to change user passwords in an OpenLDAP directory?",
		"A": "setent",
		"B": "ldpasswd",
		"C": "olppasswd",
		"D": "ldappasswd",
		"E": "ldapchpw",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 113","type":"5",
		"question": "Which of the following is correct about this excerpt from an LDIF file?",
		"A": "dn is the domain name.",
		"B": "o is the operator name.",
		"C": "cn is the common name.",
		"D": "dn is the relative distinguished name.",
		"E": "DC is the delegation container.",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 114","type":"4",
		"question": "Which of the following statements is INCORRECT regarding the LDIF file format?",
		"A": "It contains a dn line that indicates where the attributes listed in the following lines of the file must be added.",
		"B": "In the file, a blank line separates one entry from another one.",
		"C": "If an attribute contains binary data, some specific configurations must be made for this entry.",
		"D": "The LDIF file accepts any type of file encoding.",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 115","type":"4",
		"question": "Which option within the ISC DHCPD configuration file defines <br> the IPv4 DNS server address(es) to be sent to the DHCP clients?",
		"A": "domain-name-servers",
		"B": "domain-server",
		"C": "name-server",
		"D": "servers",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 116","type":"5",
		"question": "Which of the following PAM modules sets and unsets environment variables?",
		"A": "pam_set",
		"B": "pam_shell",
		"C": "pam-vars",
		"D": "pam-env",
		"E": "pam_export",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 117","type":"5",
		"question": "Which of the following lines is valid in a configuration file in /etc/pam.d/?",
		"A": "auth required pam_unix.so try_first_pass nullok",
		"B": "auth try_first_pass nullok, require pam_unix.so",
		"C": "auth required:pam_unix.so(try_first_pass nullok)",
		"D": "auth pam_unix.so(required try_first_pass nullok)",
		"corr_answer": "#A"
	},
	{
		"question_num": "QUESTION 118","type":"4",
		"question": "Select the alternative that shows the correct way to disable a <br> user login for all users except root.",
		"A": "The use of the pam_block module along with the /etc/login configuration file.",
		"B": "The use of the pam_deny module along with the /etc/deny configuration file.",
		"C": "The use of the pam_pwdb module along with the /etc/pwdv.conf configuration file.",
		"D": "The use of the pam_nologin module along with the /etc/nologin configuration file.",
		"corr_answer": "#D"
	},
	{
		"question_num": "QUESTION 119","type":"5",
		"question": "Which of the following values can be used in the OpenLDAP attribute <br> oldBackend for any object of the class olcBackendConfig to specify a backend? (Choose three.)",
		"A": "xml",
		"B": "bdb",
		"C": "passwd",
		"D": "ldap",
		"E": "text",
		"corr_answer": "#B,#D,#E"
	}
]
